{
  "POSITIVE": [
    "Thanks for sharing that with me. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "I’m glad you checked in today. It’s great that you’re feeling this way. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? Take it one step at a time.",
    "Thanks for sharing that with me. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "I’m glad you checked in today. Hold on to this positive feeling. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? We can check in again whenever you want.",
    "I hear you. It’s great that you’re feeling this way. If you want, you can share this in the community to encourage others. We can check in again whenever you want.",
    "Thank you for opening up. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? Take it one step at a time.",
    "Thank you for opening up. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "Thanks for sharing that with me. It’s lovely to see you feeling encouraged. If you want, you can share this in the community to encourage others. We can check in again whenever you want.",
    "Thank you for opening up. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? Take it one step at a time.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. If you want, you can share this in the community to encourage others. You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It’s lovely to see you feeling encouraged. Would you like a resource to keep building on what’s going well? We can check in again whenever you want.",
    "Thank you for opening up. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. It’s great that you’re feeling this way. If you want, you can share this in the community to encourage others. You’re doing your best, and that matters.",
    "I’m glad you checked in today. That’s wonderful to hear. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "I hear you. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "Thank you for opening up. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "Thanks for sharing that with me. Hold on to this positive feeling. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "It’s good you’re sharing how you feel. It’s great that you’re feeling this way. Would you like to save this as a positive moment in your journal? Take it one step at a time.",
    "I hear you. It’s lovely to see you feeling encouraged. Would you like a resource to keep building on what’s going well? We can check in again whenever you want.",
    "I’m glad you checked in today. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "Thanks for sharing that with me. It’s lovely to see you feeling encouraged. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "Thanks for sharing that with me. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "I’m glad you checked in today. Celebrate these moments—you deserve them. If you want, you can share this in the community to encourage others. Take it one step at a time.",
    "It’s good you’re sharing how you feel. Hold on to this positive feeling. If you want, you can share this in the community to encourage others. We can check in again whenever you want.",
    "I hear you. Hold on to this positive feeling. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "I’m glad you checked in today. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? Take it one step at a time.",
    "I’m glad you checked in today. Celebrate these moments—you deserve them. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "I hear you. Celebrate these moments—you deserve them. Would you like a resource to keep building on what’s going well? Take it one step at a time.",
    "It’s good you’re sharing how you feel. It’s lovely to see you feeling encouraged. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Hold on to this positive feeling. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "Thanks for sharing that with me. It’s lovely to see you feeling encouraged. If you want, you can share this in the community to encourage others. I’m here with you.",
    "I hear you. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "It’s good you’re sharing how you feel. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "Thank you for opening up. Hold on to this positive feeling. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "I’m glad you checked in today. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "I hear you. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "Thank you for opening up. It’s great that you’re feeling this way. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? Take it one step at a time.",
    "Thanks for sharing that with me. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "I hear you. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "It’s good you’re sharing how you feel. Hold on to this positive feeling. If you want, you can share this in the community to encourage others. I’m here with you.",
    "It’s good you’re sharing how you feel. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "I hear you. It’s lovely to see you feeling encouraged. If you want, you can share this in the community to encourage others. We can check in again whenever you want.",
    "I hear you. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "Thanks for sharing that with me. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "Thanks for sharing that with me. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "Thanks for sharing that with me. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "I hear you. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "I hear you. Celebrate these moments—you deserve them. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Celebrate these moments—you deserve them. If you want, you can share this in the community to encourage others. Take it one step at a time.",
    "I hear you. Celebrate these moments—you deserve them. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. That’s wonderful to hear. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "Thanks for sharing that with me. It’s great that you’re feeling this way. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "It’s good you’re sharing how you feel. Celebrate these moments—you deserve them. Would you like to save this as a positive moment in your journal? Take it one step at a time.",
    "I’m glad you checked in today. It’s lovely to see you feeling encouraged. If you want, you can share this in the community to encourage others. I’m here with you.",
    "Thanks for sharing that with me. Celebrate these moments—you deserve them. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "I’m glad you checked in today. It’s great that you’re feeling this way. If you want, you can share this in the community to encourage others. Take it one step at a time.",
    "I hear you. It’s great that you’re feeling this way. If you want, you can share this in the community to encourage others. You’re doing your best, and that matters.",
    "I’m glad you checked in today. Celebrate these moments—you deserve them. Would you like to save this as a positive moment in your journal? Take it one step at a time.",
    "Thank you for opening up. Celebrate these moments—you deserve them. If you want, you can share this in the community to encourage others. Take it one step at a time.",
    "It’s good you’re sharing how you feel. Celebrate these moments—you deserve them. Would you like to save this as a positive moment in your journal? I’m here with you.",
    "Thank you for opening up. It’s great that you’re feeling this way. Would you like to save this as a positive moment in your journal? We can check in again whenever you want.",
    "Thanks for sharing that with me. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? Take it one step at a time.",
    "It’s good you’re sharing how you feel. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "I hear you. That’s wonderful to hear. Would you like a resource to keep building on what’s going well? I’m here with you.",
    "It’s good you’re sharing how you feel. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? We can check in again whenever you want.",
    "Thanks for sharing that with me. Celebrate these moments—you deserve them. Would you like a resource to keep building on what’s going well? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. Hold on to this positive feeling. If you want, you can share this in the community to encourage others. You’re not alone in this.",
    "I’m glad you checked in today. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? You’re not alone in this.",
    "I hear you. It’s great that you’re feeling this way. Would you like a resource to keep building on what’s going well? You’re not alone in this.",
    "I hear you. It’s lovely to see you feeling encouraged. Would you like to save this as a positive moment in your journal? You’re doing your best, and that matters.",
    "I hear you. Hold on to this positive feeling. Would you like a resource to keep building on what’s going well? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Hold on to this positive feeling. Would you like to save this as a positive moment in your journal? We can check in again whenever you want.",
    "Thank you for opening up. It’s great that you’re feeling this way. If you want, you can share this in the community to encourage others. You’re doing your best, and that matters.",
    "I hear you. Hold on to this positive feeling. Would you like a resource to keep building on what’s going well? You’re not alone in this."
  ],
  "NEUTRAL": [
    "Thank you for opening up. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? You’re not alone in this.",
    "Thanks for sharing that with me. That’s okay—some days feel steady or mixed. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "I’m glad you checked in today. Thanks for sharing—checking in matters. If you want, you can explore a resource that matches your trimester. We can check in again whenever you want.",
    "I’m glad you checked in today. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? You’re not alone in this.",
    "It’s good you’re sharing how you feel. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? You’re not alone in this.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? Take it one step at a time.",
    "It’s good you’re sharing how you feel. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? You’re doing your best, and that matters.",
    "I’m glad you checked in today. I’m here whenever you want to reflect more. Would you like a short self-care checklist for today? You’re not alone in this.",
    "It’s good you’re sharing how you feel. I’m here whenever you want to reflect more. Would you like a short self-care checklist for today? Take it one step at a time.",
    "I’m glad you checked in today. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? I’m here with you.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? Take it one step at a time.",
    "It’s good you’re sharing how you feel. It’s normal to feel neutral sometimes. Would you like a short self-care checklist for today? I’m here with you.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? I’m here with you.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? I’m here with you.",
    "Thank you for opening up. It’s normal to feel neutral sometimes. Would you like to do a quick 60-second breathing reset? You’re doing your best, and that matters.",
    "I hear you. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "I’m glad you checked in today. It’s normal to feel neutral sometimes. Would you like a short self-care checklist for today? I’m here with you.",
    "I hear you. Thanks for sharing—checking in matters. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "Thank you for opening up. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "I hear you. I’m here whenever you want to reflect more. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? We can check in again whenever you want.",
    "Thank you for opening up. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? We can check in again whenever you want.",
    "I hear you. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? You’re not alone in this.",
    "I hear you. I’m here whenever you want to reflect more. Would you like to do a quick 60-second breathing reset? You’re doing your best, and that matters.",
    "I hear you. I’m here whenever you want to reflect more. Would you like a short self-care checklist for today? You’re not alone in this.",
    "Thanks for sharing that with me. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? You’re not alone in this.",
    "I hear you. Thanks for sharing—checking in matters. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "It’s good you’re sharing how you feel. It’s normal to feel neutral sometimes. Would you like a short self-care checklist for today? Take it one step at a time.",
    "I hear you. It’s normal to feel neutral sometimes. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? You’re doing your best, and that matters.",
    "Thank you for opening up. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? Take it one step at a time.",
    "It’s good you’re sharing how you feel. I’m here whenever you want to reflect more. Would you like to do a quick 60-second breathing reset? You’re not alone in this.",
    "I hear you. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "It’s good you’re sharing how you feel. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? I’m here with you.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "I’m glad you checked in today. It’s normal to feel neutral sometimes. Would you like a short self-care checklist for today? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. We can check in again whenever you want.",
    "Thanks for sharing that with me. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. We can check in again whenever you want.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "I’m glad you checked in today. It’s normal to feel neutral sometimes. Would you like to do a quick 60-second breathing reset? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? I’m here with you.",
    "It’s good you’re sharing how you feel. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? We can check in again whenever you want.",
    "I’m glad you checked in today. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "I hear you. I’m here whenever you want to reflect more. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "I hear you. I’m here whenever you want to reflect more. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "Thank you for opening up. I’m here whenever you want to reflect more. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? You’re not alone in this.",
    "I’m glad you checked in today. Thanks for sharing—checking in matters. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "It’s good you’re sharing how you feel. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? I’m here with you.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? I’m here with you.",
    "I’m glad you checked in today. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "Thank you for opening up. I’m here whenever you want to reflect more. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "Thanks for sharing that with me. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "It’s good you’re sharing how you feel. That’s okay—some days feel steady or mixed. Would you like to do a quick 60-second breathing reset? Take it one step at a time.",
    "I hear you. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "I hear you. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "I hear you. Thanks for sharing—checking in matters. Would you like to do a quick 60-second breathing reset? Take it one step at a time.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. That’s okay—some days feel steady or mixed. If you want, you can explore a resource that matches your trimester. We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? Take it one step at a time.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like a short self-care checklist for today? You’re doing your best, and that matters.",
    "Thank you for opening up. Not every day feels intense, and that’s okay. If you want, you can explore a resource that matches your trimester. I’m here with you.",
    "I hear you. Thanks for sharing—checking in matters. If you want, you can explore a resource that matches your trimester. Take it one step at a time.",
    "I hear you. That’s okay—some days feel steady or mixed. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "Thanks for sharing that with me. Thanks for sharing—checking in matters. Would you like a short self-care checklist for today? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. That’s okay—some days feel steady or mixed. Would you like a short self-care checklist for today? I’m here with you.",
    "Thanks for sharing that with me. I’m here whenever you want to reflect more. Would you like a short self-care checklist for today? I’m here with you.",
    "I’m glad you checked in today. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. You’re not alone in this.",
    "Thank you for opening up. It’s normal to feel neutral sometimes. Would you like to do a quick 60-second breathing reset? We can check in again whenever you want.",
    "Thanks for sharing that with me. It’s normal to feel neutral sometimes. If you want, you can explore a resource that matches your trimester. You’re doing your best, and that matters.",
    "I hear you. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? I’m here with you.",
    "Thanks for sharing that with me. I’m here whenever you want to reflect more. Would you like to do a quick 60-second breathing reset? I’m here with you.",
    "Thanks for sharing that with me. I’m here whenever you want to reflect more. Would you like a short self-care checklist for today? You’re not alone in this.",
    "It’s good you’re sharing how you feel. Not every day feels intense, and that’s okay. Would you like to do a quick 60-second breathing reset? You’re not alone in this."
  ],
  "STRESS": [
    "Thanks for sharing that with me. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "Thanks for sharing that with me. It makes sense that you’d feel stressed. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "I hear you. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "I’m glad you checked in today. It makes sense that you’d feel stressed. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "Thank you for opening up. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "I hear you. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? We can check in again whenever you want.",
    "Thank you for opening up. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? You’re doing your best, and that matters.",
    "Thank you for opening up. It makes sense that you’d feel stressed. Would you like a short breathing exercise (60 seconds)? Take it one step at a time.",
    "It’s good you’re sharing how you feel. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "Thank you for opening up. It sounds like you’re feeling overwhelmed. A small break, water, or a short walk can help—want tips? You’re not alone in this.",
    "I’m glad you checked in today. It makes sense that you’d feel stressed. Would you like a short breathing exercise (60 seconds)? You’re not alone in this.",
    "Thank you for opening up. That sounds like a lot to carry right now. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "Thank you for opening up. You’re managing a lot right now. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "I’m glad you checked in today. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? Take it one step at a time.",
    "I hear you. You’re managing a lot right now. Would you like a short breathing exercise (60 seconds)? Take it one step at a time.",
    "I hear you. It makes sense that you’d feel stressed. Would you like a short breathing exercise (60 seconds)? You’re doing your best, and that matters.",
    "Thank you for opening up. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? I’m here with you.",
    "Thank you for opening up. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "It’s good you’re sharing how you feel. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "It’s good you’re sharing how you feel. That sounds like a lot to carry right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "Thank you for opening up. That sounds like a lot to carry right now. A small break, water, or a short walk can help—want tips? I’m here with you.",
    "Thanks for sharing that with me. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. Stress during pregnancy can feel heavy. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "I hear you. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? You’re not alone in this.",
    "I’m glad you checked in today. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "I’m glad you checked in today. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? I’m here with you.",
    "I hear you. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "Thank you for opening up. It makes sense that you’d feel stressed. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "Thank you for opening up. Stress during pregnancy can feel heavy. Would you like a short breathing exercise (60 seconds)? You’re not alone in this.",
    "I hear you. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? Take it one step at a time.",
    "I hear you. It sounds like you’re feeling overwhelmed. Would you like to view stress-management resources for pregnancy? You’re doing your best, and that matters.",
    "I’m glad you checked in today. Stress during pregnancy can feel heavy. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "Thanks for sharing that with me. Stress during pregnancy can feel heavy. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "I hear you. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? We can check in again whenever you want.",
    "I’m glad you checked in today. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "Thank you for opening up. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "Thank you for opening up. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "I’m glad you checked in today. You’re managing a lot right now. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "Thanks for sharing that with me. It makes sense that you’d feel stressed. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "I hear you. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "Thank you for opening up. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "Thanks for sharing that with me. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "I’m glad you checked in today. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? I’m here with you.",
    "Thanks for sharing that with me. It sounds like you’re feeling overwhelmed. Would you like a short breathing exercise (60 seconds)? You’re not alone in this.",
    "Thanks for sharing that with me. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "I hear you. It makes sense that you’d feel stressed. Would you like a short breathing exercise (60 seconds)? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. That sounds like a lot to carry right now. Would you like a short breathing exercise (60 seconds)? You’re doing your best, and that matters.",
    "I’m glad you checked in today. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? You’re doing your best, and that matters.",
    "Thank you for opening up. You’re managing a lot right now. Would you like a short breathing exercise (60 seconds)? I’m here with you.",
    "I hear you. You’re managing a lot right now. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "Thank you for opening up. Stress during pregnancy can feel heavy. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "I hear you. It sounds like you’re feeling overwhelmed. A small break, water, or a short walk can help—want tips? You’re not alone in this.",
    "I hear you. That sounds like a lot to carry right now. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That sounds like a lot to carry right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "Thank you for opening up. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? You’re doing your best, and that matters.",
    "Thank you for opening up. It sounds like you’re feeling overwhelmed. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "Thanks for sharing that with me. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "Thanks for sharing that with me. Stress during pregnancy can feel heavy. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "It’s good you’re sharing how you feel. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "Thanks for sharing that with me. It sounds like you’re feeling overwhelmed. Would you like to view stress-management resources for pregnancy? We can check in again whenever you want.",
    "I’m glad you checked in today. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "Thanks for sharing that with me. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "I’m glad you checked in today. It sounds like you’re feeling overwhelmed. A small break, water, or a short walk can help—want tips? You’re doing your best, and that matters.",
    "I’m glad you checked in today. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "I hear you. Stress during pregnancy can feel heavy. A small break, water, or a short walk can help—want tips? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. Stress during pregnancy can feel heavy. Would you like a short breathing exercise (60 seconds)? You’re not alone in this.",
    "I hear you. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "Thanks for sharing that with me. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? You’re not alone in this.",
    "I’m glad you checked in today. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? Take it one step at a time.",
    "Thank you for opening up. That sounds like a lot to carry right now. Would you like to view stress-management resources for pregnancy? We can check in again whenever you want.",
    "I hear you. It makes sense that you’d feel stressed. A small break, water, or a short walk can help—want tips? I’m here with you.",
    "I’m glad you checked in today. You’re managing a lot right now. A small break, water, or a short walk can help—want tips? I’m here with you.",
    "I hear you. It sounds like you’re feeling overwhelmed. A small break, water, or a short walk can help—want tips? Take it one step at a time.",
    "I hear you. It makes sense that you’d feel stressed. Would you like to view stress-management resources for pregnancy? I’m here with you."
  ],
  "ANXIETY": [
    "It’s good you’re sharing how you feel. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? Take it one step at a time.",
    "Thanks for sharing that with me. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "I’m glad you checked in today. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? I’m here with you.",
    "Thanks for sharing that with me. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? You’re not alone in this.",
    "It’s good you’re sharing how you feel. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? You’re doing your best, and that matters.",
    "Thank you for opening up. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? You’re not alone in this.",
    "I hear you. You’re not alone in feeling anxious. Would you like a grounding exercise to calm your thoughts? We can check in again whenever you want.",
    "Thanks for sharing that with me. Anxiety can show up strongly during pregnancy. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "I’m glad you checked in today. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. It’s understandable to feel anxious about changes. Would you like a grounding exercise to calm your thoughts? You’re not alone in this.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "Thank you for opening up. That worry sounds uncomfortable to sit with. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "I’m glad you checked in today. Anxiety can show up strongly during pregnancy. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "It’s good you’re sharing how you feel. Anxiety can show up strongly during pregnancy. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "Thanks for sharing that with me. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "I’m glad you checked in today. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "I hear you. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? You’re doing your best, and that matters.",
    "I hear you. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? We can check in again whenever you want.",
    "I’m glad you checked in today. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? You’re not alone in this.",
    "It’s good you’re sharing how you feel. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "Thank you for opening up. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "I hear you. It’s understandable to feel anxious about changes. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "I hear you. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "Thank you for opening up. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? Take it one step at a time.",
    "Thank you for opening up. It sounds like you’re feeling worried or anxious. Would you like to talk to a mentor in the community? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "It’s good you’re sharing how you feel. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "It’s good you’re sharing how you feel. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? I’m here with you.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "Thanks for sharing that with me. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "Thanks for sharing that with me. That worry sounds uncomfortable to sit with. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "I’m glad you checked in today. Anxiety can show up strongly during pregnancy. Would you like a grounding exercise to calm your thoughts? We can check in again whenever you want.",
    "Thank you for opening up. You’re not alone in feeling anxious. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "I’m glad you checked in today. That worry sounds uncomfortable to sit with. If it helps, we can look at coping strategies together—want a resource? You’re not alone in this.",
    "Thank you for opening up. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? You’re doing your best, and that matters.",
    "I hear you. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "It’s good you’re sharing how you feel. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "Thanks for sharing that with me. Anxiety can show up strongly during pregnancy. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "I’m glad you checked in today. It sounds like you’re feeling worried or anxious. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "Thank you for opening up. It’s understandable to feel anxious about changes. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. Would you like a grounding exercise to calm your thoughts? We can check in again whenever you want.",
    "I’m glad you checked in today. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? You’re not alone in this.",
    "It’s good you’re sharing how you feel. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? I’m here with you.",
    "I hear you. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "I hear you. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? You’re not alone in this.",
    "I’m glad you checked in today. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "Thank you for opening up. It sounds like you’re feeling worried or anxious. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "Thank you for opening up. Anxiety can show up strongly during pregnancy. Would you like a grounding exercise to calm your thoughts? Take it one step at a time.",
    "Thanks for sharing that with me. Anxiety can show up strongly during pregnancy. Would you like to talk to a mentor in the community? We can check in again whenever you want.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "I’m glad you checked in today. You’re not alone in feeling anxious. Would you like a grounding exercise to calm your thoughts? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. Anxiety can show up strongly during pregnancy. Would you like to talk to a mentor in the community? I’m here with you.",
    "I’m glad you checked in today. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? We can check in again whenever you want.",
    "Thanks for sharing that with me. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "It’s good you’re sharing how you feel. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Anxiety can show up strongly during pregnancy. Would you like a grounding exercise to calm your thoughts? You’re not alone in this.",
    "I’m glad you checked in today. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That worry sounds uncomfortable to sit with. Would you like a grounding exercise to calm your thoughts? I’m here with you.",
    "I hear you. You’re not alone in feeling anxious. Would you like a grounding exercise to calm your thoughts? You’re doing your best, and that matters.",
    "I hear you. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "I’m glad you checked in today. You’re not alone in feeling anxious. Would you like a grounding exercise to calm your thoughts? We can check in again whenever you want.",
    "Thank you for opening up. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. It’s understandable to feel anxious about changes. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "Thanks for sharing that with me. It’s understandable to feel anxious about changes. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? We can check in again whenever you want.",
    "I’m glad you checked in today. It sounds like you’re feeling worried or anxious. Would you like a grounding exercise to calm your thoughts? You’re not alone in this.",
    "It’s good you’re sharing how you feel. You’re not alone in feeling anxious. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "I hear you. You’re not alone in feeling anxious. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "I hear you. You’re not alone in feeling anxious. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "Thanks for sharing that with me. It sounds like you’re feeling worried or anxious. Would you like to talk to a mentor in the community? We can check in again whenever you want.",
    "I hear you. That worry sounds uncomfortable to sit with. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "I hear you. It sounds like you’re feeling worried or anxious. If it helps, we can look at coping strategies together—want a resource? Take it one step at a time.",
    "Thank you for opening up. That worry sounds uncomfortable to sit with. If it helps, we can look at coping strategies together—want a resource? I’m here with you.",
    "I hear you. It sounds like you’re feeling worried or anxious. Would you like a grounding exercise to calm your thoughts? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. You’re not alone in feeling anxious. If it helps, we can look at coping strategies together—want a resource? You’re doing your best, and that matters.",
    "I hear you. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? Take it one step at a time.",
    "Thanks for sharing that with me. That worry sounds uncomfortable to sit with. Would you like to talk to a mentor in the community? You’re not alone in this.",
    "Thank you for opening up. It sounds like you’re feeling worried or anxious. Would you like to talk to a mentor in the community? We can check in again whenever you want."
  ],
  "LOW_MOOD": [
    "I’m glad you checked in today. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thank you for opening up. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "I’m glad you checked in today. Low mood can happen during pregnancy, and it matters. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "It’s good you’re sharing how you feel. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? We can check in again whenever you want.",
    "Thank you for opening up. It sounds like you’re feeling low today. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "Thank you for opening up. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? Take it one step at a time.",
    "Thanks for sharing that with me. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? Take it one step at a time.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "Thank you for opening up. I’m sorry you’re feeling this way. Would you like resources on emotional well-being during pregnancy? You’re not alone in this.",
    "It’s good you’re sharing how you feel. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? You’re doing your best, and that matters.",
    "I’m glad you checked in today. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? Take it one step at a time.",
    "I hear you. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? Take it one step at a time.",
    "Thank you for opening up. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters.",
    "Thank you for opening up. Low mood can happen during pregnancy, and it matters. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "It’s good you’re sharing how you feel. Low mood can happen during pregnancy, and it matters. Would you like resources on emotional well-being during pregnancy? You’re not alone in this.",
    "Thanks for sharing that with me. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thanks for sharing that with me. It sounds like you’re feeling low today. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "I’m glad you checked in today. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? You’re not alone in this.",
    "Thank you for opening up. It sounds like you’re feeling low today. Would you like gentle ideas to support your mood today? Take it one step at a time.",
    "I hear you. That sounds emotionally tough. Would you like gentle ideas to support your mood today? Take it one step at a time.",
    "It’s good you’re sharing how you feel. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "Thank you for opening up. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "I hear you. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "Thank you for opening up. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "I hear you. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "Thanks for sharing that with me. Low mood can happen during pregnancy, and it matters. Would you like gentle ideas to support your mood today? I’m here with you.",
    "I hear you. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thanks for sharing that with me. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? You’re not alone in this.",
    "I’m glad you checked in today. I’m sorry you’re feeling this way. Would you like gentle ideas to support your mood today? You’re doing your best, and that matters.",
    "It’s good you’re sharing how you feel. It sounds like you’re feeling low today. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "I’m glad you checked in today. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "I’m glad you checked in today. It sounds like you’re feeling low today. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "I’m glad you checked in today. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? I’m here with you.",
    "Thanks for sharing that with me. That sounds emotionally tough. Would you like resources on emotional well-being during pregnancy? Take it one step at a time.",
    "I hear you. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? Take it one step at a time.",
    "It’s good you’re sharing how you feel. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? You’re not alone in this.",
    "I’m glad you checked in today. Low mood can happen during pregnancy, and it matters. Would you like gentle ideas to support your mood today? Take it one step at a time.",
    "I hear you. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters.",
    "Thank you for opening up. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "Thanks for sharing that with me. Low mood can happen during pregnancy, and it matters. Would you like resources on emotional well-being during pregnancy? I’m here with you.",
    "I’m glad you checked in today. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "Thank you for opening up. It sounds like you’re feeling low today. Would you like resources on emotional well-being during pregnancy? I’m here with you.",
    "I hear you. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "I’m glad you checked in today. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? You’re not alone in this.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "Thanks for sharing that with me. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? Take it one step at a time.",
    "Thank you for opening up. I’m sorry you’re feeling this way. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "I’m glad you checked in today. I’m sorry you’re feeling this way. Would you like gentle ideas to support your mood today? We can check in again whenever you want.",
    "I’m glad you checked in today. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? Take it one step at a time.",
    "I’m glad you checked in today. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters.",
    "Thank you for opening up. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? You’re not alone in this.",
    "I’m glad you checked in today. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? Take it one step at a time.",
    "It’s good you’re sharing how you feel. I’m sorry you’re feeling this way. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "Thank you for opening up. That sounds emotionally tough. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "I hear you. That sounds emotionally tough. Would you like gentle ideas to support your mood today? I’m here with you.",
    "It’s good you’re sharing how you feel. Thank you for sharing—this can be hard. Would you like resources on emotional well-being during pregnancy? We can check in again whenever you want.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Would you like resources on emotional well-being during pregnancy? I’m here with you.",
    "It’s good you’re sharing how you feel. Low mood can happen during pregnancy, and it matters. Would you like gentle ideas to support your mood today? I’m here with you.",
    "Thanks for sharing that with me. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "I’m glad you checked in today. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "I hear you. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? Take it one step at a time.",
    "It’s good you’re sharing how you feel. Thank you for sharing—this can be hard. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "Thanks for sharing that with me. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thanks for sharing that with me. Thank you for sharing—this can be hard. Would you like gentle ideas to support your mood today? You’re not alone in this.",
    "Thanks for sharing that with me. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? Take it one step at a time.",
    "It’s good you’re sharing how you feel. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "I’m glad you checked in today. Low mood can happen during pregnancy, and it matters. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "I hear you. It sounds like you’re feeling low today. Reaching out to someone you trust can help—want suggestions? We can check in again whenever you want.",
    "Thank you for opening up. That sounds emotionally tough. Reaching out to someone you trust can help—want suggestions? You’re doing your best, and that matters.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Would you like gentle ideas to support your mood today? I’m here with you.",
    "Thanks for sharing that with me. I’m sorry you’re feeling this way. Reaching out to someone you trust can help—want suggestions? I’m here with you.",
    "I hear you. Low mood can happen during pregnancy, and it matters. Would you like resources on emotional well-being during pregnancy? You’re doing your best, and that matters."
  ],
  "HIGH_DISTRESS": [
    "I’m really sorry you’re feeling this way. You deserve support. If you feel unsafe or overwhelmed, please contact a healthcare professional or local support services right now.",
    "Thank you for sharing this. If you feel like you might harm yourself or you feel unsafe, please seek immediate help from a professional or emergency services. You deserve care and support.",
    "I’m concerned about how intense this feels for you. Please reach out to someone you trust and consider contacting a healthcare provider or local crisis support services right away."
  ]
}